Repository: Speed3d/accounting_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Settings
ar: الإعدادات

source: Home Page
ar: الصفحة الرئيسية

source: Users
ar: المستخدمين

source: Suppliers
ar: الموردين

source: Products
ar: المنتجات

source: Employees
ar: الموظفين

source: Customers
ar: العملاء

source: Reports
ar: التقارير

source: Customization
ar: التخصيص

source: Company Information
ar: معلومات الشركة

source: Change app name and logo
ar: تغيير اسم وشعار التطبيق

source: Data Management
ar: إدارة البيانات

source: Archive Center
ar: مركز الأرشفة

source: Restore archived items
ar: استعادة العناصر المؤرشفة

source: No archived customers
ar: لا يوجد زبائن مؤرشفة

source: No archived products
ar: لا يوجد منتجات مؤرشفة

source: No archived suppliers
ar: لا يوجد موردين مؤرشفة

source: Backup and Restore
ar: النسخ الاحتياطي والاستعادة

source: Save and restore app data
ar: حفظ واستعادة بيانات التطبيق

source: About
ar: حول

source: About The App
ar: حول التطبيق

source: Language
ar: اللغة

# changeLanguage
source: Change app language
ar: تغيير لغة التطبيق

source: Customers List
ar: قائمة الزبائن

# noActiveCustomers
source: No active customers yet.
ar: لا يوجد زبائن نشطون حتى الآن.

source: Phone
ar: الهاتف

# unregistered
source: Not registered
ar: غير مسجل

# remainingForHim
source: Credit
ar: له رصيد

# remainingOnHim
source: Debt
ar: له دين

source: Balance
ar: الرصيد

source: Archive
ar: أرشفة

source: Confirm Archive
ar: تأكيد الأرشفة

source: Cancel
ar: إلغاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Add/Edit Customer
ar: إضافة/تعديل زبون

source: Customer Name
ar: اسم الزبون

source: Address (Optional)
ar: العنوان (اختياري)

source: Phone (Optional)
ar: الهاتف (اختياري)

# fieldRequired
source: Field is required
ar: الحقل مطلوب

# customerAddedSuccess
source: Customer added successfully!
ar: تم إضافة الزبون بنجاح!

# customerUpdatedSuccess
source: Customer updated successfully!
ar: تم تحديث الزبون بنجاح!

source: Choose Image Source
ar: اختر مصدر الصورة

source: Gallery
ar: المعرض

source: Camera
ar: الكاميرا

source: Customer Details
ar: تفاصيل الزبون

source: Purchases
ar: عمليات الشراء

source: Payments
ar: الدفعات

# noPurchases
source: No purchases recorded.
ar: لا توجد عمليات شراء مسجلة.

# noPayments
source: No payments recorded.
ar: لا توجد دفعات مسجلة.

# newSaleSuccess
source: New sale recorded successfully!
ar: تم تسجيل عملية الشراء بنجاح!

source: New Payment
ar: تسجيل دفعة جديدة

source: Paid Amount
ar: المبلغ المدفوع

# amountRequired
source: Amount is required
ar: المبلغ مطلوب

# enterValidAmount
source: Enter a valid amount greater than zero
ar: أدخل مبلغًا صحيحًا أكبر من صفر

# amountExceedsDebt
source: Amount is greater than the remaining debt
ar: المبلغ أكبر من الدين المتبقي

source: Notes (Optional)
ar: ملاحظات (اختياري)

# paymentSuccess
source: Payment recorded successfully!
ar: تم تسجيل الدفعة بنجاح!

# returnConfirmTitle
source: Confirm Return
ar: تأكيد الإرجاع

# returnConfirmContent
source: Are you sure you want to return this item? "{details}" The quantity will be returned to stock and the customer's account will be adjusted.
ar: هل أنت متأكد من إرجاع هذا المنتج؟ "{details}" سيتم إعادة الكمية للمخزن وتعديل حساب الزبون.

# returnSuccess
source: Item returned successfully!
ar: تم إرجاع المنتج بنجاح!

source: Error occurred
ar: حدث خطأ

source: Return Item
ar: تأكيد الإرجاع

# saleDetails
source: Sale Details: {productName} (Qty: {quantity})
ar: تفاصيل البيع: {productName} (الكمية: {quantity})

# newAdvanceFor
source: New Advance for: {name}
ar: سلفة جديدة لـ: {name}

source: Advance amount
ar: مبلغ السلفة

source: Advance Date
ar: تاريخ السلفة

source: Save Advance
ar: حفظ السلفة

# advanceAddedSuccess
source: Advance recorded successfully!
ar: تم تسجيل السلفة بنجاح!

source: Unpaid
ar: غير مسددة

source: Add employee
ar: إضافة موظف

source: Edit Employee
ar: تعديل بيانات موظف

# employeeName
source: Employee Full Name
ar: اسم الموظف الكامل

# employeeNameRequired
source: Employee name is required
ar: اسم الموظف مطلوب

source: Job Title
ar: العنوان الوظيفي

# jobTitleRequired
source: Job title is required
ar: العنوان الوظيفي مطلوب

source: Base Salary
ar: الراتب الأساسي

# baseSalaryRequired
source: Base salary is required
ar: الراتب الأساسي مطلوب

# enterValidNumber
source: Please enter a valid number
ar: أدخل رقماً صحيحاً

source: Hire Date
ar: تاريخ التعيين

# employeeAddedSuccess
source: Employee added successfully
ar: تم إضافة الموظف بنجاح!

# employeeUpdatedSuccess
source: Employee data updated successfully
ar: تم تحديث الموظف بنجاح!

# payrollFor
source: Payroll for: {name}
ar: راتب: {name}

source: Payroll for month and year:
ar: الراتب عن شهر وسنة:

source: Month
ar: الشهر

source: Year
ar: السنة

# payrollAlreadyExists
source: Error: A payroll for this month has already been recorded.
ar: خطأ: تم تسجيل راتب لهذا الشهر بالفعل.

# payrollSavedSuccess
source: Payroll saved successfully!
ar: تم تسجيل الراتب بنجاح!

source: Bonuses
ar: المكافآت والحوافز

source: Deductions
ar: الخصومات

source: Advance Repayment (-)
ar: تسديد من السلفة (-)

# currentBalanceOnEmployee
source: Current balance on employee: {balance}
ar: الرصيد الحالي على الموظف: {balance}

# enterZeroIfNotRepaying
source: Enter 0 if there is no repayment
ar: أدخل 0 إذا لم يكن هناك تسديد

# repaymentExceedsBalance
source: Amount is greater than the employee's advance balance
ar: المبلغ أكبر من رصيد السلفة على الموظف

source: Payment Date
ar: تاريخ الدفع

source: Save and Pay Salary
ar: حفظ وتسديد الراتب

source: Net Salary Due
ar: الراتب الصافي المستحق للدفع

# fieldRequiredEnterZero
source: This field is required, enter 0 if no value
ar: الحقل مطلوب، أدخل 0 للقيمة الصفرية

source: Payroll History
ar: سجل الرواتب

source: Advances History
ar: سجل السلف

# noPayrolls
source: No payrolls recorded.
ar: لا توجد رواتب مسجلة.

# noAdvances
source: No advances recorded
ar: لا توجد سلف مسجلة

# payrollDetailsFor
source: Payroll Details for {month}
ar: تفاصيل راتب شهر {month}

# paidOn
source: Paid on: {date}
ar: تاريخ الدفع: {date}

# payrollOfMonth
source: Payroll for {month} {year}
ar: راتب شهر: {month} {year}

# advanceAmountLabel
source: Advance Amount: {amount}
ar: مبلغ السلفة: {amount}

# advanceDateLabel
source: Advance Date: {date}
ar: تاريخ السلفة: {date}

source: Fully paid
ar: مسددة بالكامل

source: Employees List
ar: قائمة الموظفين

# noEmployees
source: No employees currently. Press + to add the first employee.
ar: لا يوجد موظفون حاليًا. اضغط على زر + لإضافة أول موظف.

# jobTitleLabel
source: Job Title: {title}
ar: العنوان الوظيفي: {title}

# baseSalaryLabel
source: Base Salary: {salary}
ar: الراتب الأساسي: {salary}

# advancesBalanceLabel
source: Advances Balance: {balance}
ar: رصيد السلف: {balance}

source: Suppliers List
ar: قائمة الموردين

source: No active suppliers.
ar: لا يوجد موردون نشطون.

source: Type
ar: النوع

source: Individual
ar: فردي

source: Partner
ar: شريك

source: Add supplier
ar: إضافة مورد

source: Edit Supplier
ar: تعديل مورد

source: Supplier Name
ar: اسم المورد

# supplierNameRequired
source: Supplier name is required
ar: اسم المورد مطلوب

source: Supplier Type
ar: نوع المورد

source: Partnership
ar: شراكة

source: Partners
ar: شراكات

source: Add Partner
ar: إضافة شريك

# atLeastOnePartnerRequired
source: At least one partner must be added for a partnership type.
ar: يجب إضافة شريك واحد على الأقل لنوع الشراكة.

# partnerShareTotalExceeds100
source: Error: Total partner shares ({total}%) exceeds 100%.
ar: خطأ: مجموع نسب الشركاء ({total}%) يتجاوز 100%.

# supplierAddedSuccess
source: Supplier added successfully!
ar: تم إضافة المورد بنجاح!

# supplierUpdatedSuccess
source: Supplier updated successfully!
ar: تم تحديث المورد بنجاح!

source: Add new partner
ar: إضافة شريك جديد

source: Partner Name
ar: اسم الشريك

# partnerNameRequired
source: Partner name is required
ar: اسم الشريك مطلوب

source: Share Percentage (%)
ar: نسبة الشراكة (%)

source: Percentage must be between 1 and 100
ar: النسبة يجب أن تكون بين 1 و 100

# shareTotalExceeds100
source: Error: Total partner shares cannot exceed 100%.
ar: خطأ: مجموع نسب الشركاء لا يمكن أن يتجاوز 100%.

# percentageLabel
source: Percentage: {percentage}%
ar: النسبة: {percentage}%

# typeLabel
source: Type: {type}
ar: النوع: {type}

# cannotArchiveSupplierWithActiveProducts
source: This supplier cannot be archived because they are linked to active products.
ar: لا يمكن أرشفة هذا المورد لأنه مرتبط بمنتجات نشطة.

# archiveSupplierConfirmation
source: Are you sure you want to archive the supplier "{name}"? They will be hidden from lists.
ar: هل أنت متأكد من أرشفة المورد "{name}"؟ سيتم إخفاؤه من القوائم.

# archiveSupplierLog
source: Archive Supplier: {name}
ar: أرشفة المورد: {name}

source: Add user
ar: إضافة مستخدم

source: Edit User
ar: تعديل مستخدم

# passwordRequiredForNewUser
source: Password is required for a new user
ar: كلمة المرور مطلوبة للمستخدم الجديد

# userAddedSuccess
source: User added successfully!
ar: تم إضافة المستخدم بنجاح!

# userUpdatedSuccess
source: User updated successfully!
ar: تم تحديث المستخدم بنجاح!

# usernameAlreadyExists
source: This username already exists. Please choose another one.
ar: اسم المستخدم هذا موجود بالفعل. الرجاء اختيار اسم آخر.

# passwordHint
source: Leave blank to keep unchanged
ar: اتركه فارغًا لعدم التغيير

source: User Permissions
ar: صلاحيات المستخدم

# adminPermission
source: Full Admin Privileges
ar: مدير كامل الصلاحيات (Admin)

# adminPermissionSubtitle
source: Grants all permissions and overrides any other selection.
ar: يمنحه كل الصلاحيات ويتجاوز أي تحديد آخر.

source: View Suppliers
ar: عرض الموردين

source: Edit Suppliers
ar: تعديل الموردين

source: View Products
ar: عرض المنتجات

source: Edit Products
ar: تعديل المنتجات

source: View Customers
ar: عرض الزبائن

source: Edit Customers
ar: تعديل الزبائن

source: View Reports
ar: عرض التقارير

source: View Employees Report
ar: عرض تقرير الموظفين

source: View Settings
ar: عرض الإعدادات

source: Manage Employees
ar: إدارة الموظفين

# manageExpenses
source: Manage General Expenses
ar: إدارة المصاريف العامة

# viewCashSales
source: View Cash Sales Reports
ar: عرض تقارير البيع النقدي

source: Users List
ar: قائمة المستخدمين

# noUsers
source: No users available
ar: لا يوجد مستخدمين حالياً

source: (You)
ar: (أنت)

source: Admin
ar: مدير

# customPermissionsUser
source: User with custom permissions
ar: مستخدم بصلاحيات مخصصة

# usernameLabel
source: Username
ar: اسم المستخدم

# cannotEditOwnAccount
source: You cannot edit your own account from here. Use the settings screen instead.
ar: لا يمكنك تعديل حسابك الخاص من هنا. استخدم شاشة الإعدادات بدلاً من ذلك.

# cannotDeleteOwnAccount
source: You cannot delete your own account.
ar: لا يمكنك حذف حسابك الخاص.

# cannotDeleteLastUser
source: The last user in the system cannot be deleted.
ar: لا يمكن حذف آخر مستخدم في النظام.

# deleteUserConfirmation
source: Are you sure you want to delete the user "{name}"? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف المستخدم "{name}"؟ هذا الإجراء لا يمكن التراجع عنه.

# deleteUserLog
source: Delete user: {name}
ar: حذف المستخدم: {name}

source: Products List
ar: قائمة المنتجات

# noActiveProducts
source: No active products in stock.
ar: لا توجد منتجات نشطة في المخزن.

# searchForProduct
source: Search for a product ...
ar: ابحث عن منتج...

# noMatchingResults
source: No matching results found.
ar: لا توجد نتائج مطابقة للبحث.

source: Supplier
ar: المورد

source: Quantity
ar: الكمية

source: Selling Price
ar: سعر البيع

# cannotArchiveSoldProduct
source: This product cannot be archived because it is linked to previous sales.
ar: لا يمكن أرشفة هذا المنتج لأنه مرتبط بعمليات بيع سابقة.

# archiveProductConfirmation
source: Are you sure you want to archive the product "{name}"?
ar: هل أنت متأكد من أرشفة المنتج "{name}"؟

# supplierLabel
source: Supplier: {name}
ar: المورد: {name}

# quantityLabel
source: Quantity: {qty}
ar: الكمية: {qty}

source: Undefined
ar: غير محدد

# sellingPriceLabel
source: Selling Price: {price}
ar: سعر البيع: {price}

source: Add product
ar: إضافة منتج

source: Edit Product
ar: تعديل منتج

# pleaseSelectSupplier
source: Please select a supplier
ar: الرجاء اختيار مورد

# productAddedSuccess
source: Product added successfully!
ar: تم إضافة المنتج بنجاح!

# productUpdatedSuccess
source: Product updated successfully!
ar: تم تحديث المنتج بنجاح!

source: Product Name
ar: اسم المنتج

# productNameRequired
source: Product name is required
ar: اسم المنتج مطلوب

source: Product Details (Optional)
ar: تفاصيل المنتج (اختياري)

source: Cost price
ar: سعر التكلفة

source: Field cannot be negative
ar: لا يمكن أن يكون الرقم سالبًا

# selectSupplier
source: Select a supplier
ar: اختر المورد

source: Error loading suppliers.
ar: خطأ في تحميل الموردين.

# noSuppliersAddOneFirst
source: No suppliers found. Please add a supplier first.
ar: لا يوجد موردون. الرجاء إضافة مورد أولاً.

source: Barcode
ar: الباركود

source: Barcode (Optional)
ar: الباركود (اختياري)

source: Scan barcode
ar: مسح الباركود

# cameraPermissionRequired
source: Camera permission is required to scan barcodes.
ar: إذن استخدام الكاميرا مطلوب لمسح الباركود.

source: Open Settings
ar: فتح الإعدادات

# barcodeAlreadyExists
source: Error: This barcode is already assigned to another product.
ar: خطأ: هذا الباركود مسجل لمنتج آخر بالفعل.

# productUpdatedWithBarcodeLog
source: Update product with barcode: {name}
ar: تحديث منتج مع باركود: {name}

# productAddedWithBarcodeLog
source: Add new product with barcode: {name}
ar: إضافة منتج جديد مع باركود: {name}

# productNotFound
source: Product not found or inactive
ar: المنتج غير موجود أو غير نشط

source: Scan Barcode to Sell
ar: مسح باركود للبيع

# addWithProductName
source: Add "{productName}"
ar: إضافة "{productName}"

# barcodeExistsError
source: This barcode is already registered for another product.
ar: هذا الباركود مسجل لمنتج آخر بالفعل.

source: Reports Hub
ar: مركز التقارير

source: Profit Report
ar: تقرير الأرباح

# profitReportDesc
source: View net profit from all sales
ar: عرض صافي الربح من جميع المبيعات

source: Supplier Profit Report
ar: تقرير أرباح الموردين والشركاء

# supplierProfitReportDesc
source: View profits grouped by each supplier
ar: عرض الأرباح مجمعة حسب كل مورد

source: Employees Report
ar: تقرير الموظفين

# employeesReportDesc
source: Summary of salaries, advances, and employee statements
ar: ملخص الرواتب والسلف وكشوفات حساب الموظفين

source: Login
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: Login to
ar: تسجيل الدخول إلى

# accountingProgram
source: Accountants touch
ar: برنامج المحاسبة

# invalidCredentials
source: Incorrect username or password.
ar: اسم المستخدم أو كلمة المرور غير صحيحة.

source: OK
ar: موافق

source: Error
ar: خطأ

source: Success
ar: بنجاح

# backupStarted
source: Backup sharing started.
ar: تم بدء مشاركة النسخة الاحتياطية.

# backupFailed
source: Backup failed: {error}
ar: فشل النسخ الاحتياطي: {error}

# restoreConfirmTitle
source: Confirm Restore
ar: تأكيد الاستعادة

# restoreConfirmContent
source: Are you sure? All your current data will be replaced by the data in the backup. This action cannot be undone.
ar: هل أنت متأكد؟ سيتم استبدال جميع بياناتك الحالية بالبيانات الموجودة في النسخة الاحتياطية. لا يمكن التراجع عن هذا الإجراء.

source: Restore
ar: استعادة

# restoreSuccessTitle
source: Restore Successful
ar: تمت الاستعادة بنجاح

# restoreSuccessContent
source: Data restored successfully. Please restart the app to apply changes.
ar: تم استعادة البيانات بنجاح. يرجى إغلاق التطبيق وإعادة تشغيله لتطبيق التغييرات.

# restoreFailed
source: Restore failed: {error}
ar: فشل الاستعادة: {error}

# createBackupTitle
source: Create & Share Backup
ar: إنشاء ومشاركة نسخة احتياطية

# createBackupSubtitle
source: Save an encrypted copy of your data and share it to a safe place.
ar: حفظ نسخة مشفرة من بياناتك ومشاركتها في مكان آمن.

# restoreFromFileTitle
source: Restore Data from File
ar: استعادة البيانات من ملف

# restoreFromFileSubtitle
source: Warning: This will replace all current data.
ar: تحذير: هذه العملية ستحل محل جميع البيانات الحالية.

# backupTip
source: Tip: Periodically back up your data off-device (to Google Drive or email) to protect it from loss or damage.
ar: تلميح: احتفظ بنسخ احتياطية بشكل دوري خارج جهازك (على Google Drive أو البريد الإلكتروني) لحماية بياناتك من الضياع أو التلف.

source: Company or Shop Name
ar: اسم الشركة أو المحل

# companyDescOptional
source: Company Description (Optional)
ar: وصف الشركة (اختياري)

# companyDescHint
source: e.g., business activity, short address...
ar: مثال: نشاط تجاري، عنوان مختصر...

# companyInfoHint
source: This name and logo will appear on the splash screen and in reports.
ar: سيظهر هذا الاسم والشعار في شاشة البداية والتقارير.

# infoSavedSuccess
source: Information saved successfully!
ar: تم حفظ المعلومات بنجاح!

# errorPickingImage
source: Error picking image: {error}
ar: حدث خطأ أثناء اختيار الصورة: {error}

source: Archived Customer
ar: زبون مؤرشف

source: Archived Supplier
ar: مورد مؤرشف

# archivedProduct
source: Archived Product | Supplier: {supplierName}
ar: منتج مؤرشف | المورد: {supplierName}

source: Unknown
ar: غير معروف

# itemRestoredSuccess
source: Item "{name}" restored successfully!
ar: تم استعادة "{name}" بنجاح!

source: No archived items.
ar: لا توجد عناصر مؤرشفة.

source: Setup Admin Account
ar: إعداد حساب المدير

# welcomeSetup
source: Welcome! This is a one-time setup. This account will have all permissions.
ar: مرحبًا بك! هذا هو الإعداد لمرة واحدة فقط. هذا الحساب سيكون له كل الصلاحيات.

source: Full Name
ar: الاسم الكامل

# fullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

source: Username (for login)
ar: اسم المستخدم (للدخول)

# usernameRequired
source: Username is required
ar: اسم المستخدم مطلوب

# chooseStrongPassword
source: Choose a strong password
ar: اختر كلمة مرور قوية

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordTooShort
source: Password must be at least 4 characters
ar: يجب أن تكون كلمة المرور 4 أحرف على الأقل

# createAdminAndStart
source: Create Admin & Start
ar: إنشاء حساب المدير والبدء

# adminCreatedSuccess
source: Admin account created successfully! You can now log in.
ar: تم إنشاء حساب المدير بنجاح! يمكنك الآن تسجيل الدخول.

# usernameExists
source: This username already exists. Please choose another one.
ar: اسم المستخدم هذا موجود بالفعل. الرجاء اختيار اسم آخر.

# unexpectedError
source: An unexpected error occurred: {error}
ar: حدث خطأ غير متوقع: {error}

source: Please enter username
ar: الرجاء إدخال اسم المستخدم

source: Please enter password
ar: الرجاء إدخال كلمة المرور

source: Add Customer
ar: إضافة زبون

source: Edit Customer
ar: تعديل زبون

# customerNameRequired
source: Customer name is required
ar: اسم الزبون مطلوب

source: Image Source
ar: اختر مصدر الصورة

# cannotArchiveCustomerWithDebt
source: Cannot archive a customer with remaining debt.
ar: لا يمكن أرشفة زبون لديه دين متبقي.

# archiveConfirmTitle
source: Confirm Archive
ar: تأكيد الأرشفة

# archiveConfirmContent
source: Are you sure you want to archive the customer "{name}"?
ar: هل أنت متأكد من أرشفة الزبون "{name}"؟

source: Choose Products
ar: اختر المنتجات

source: Review Cart
ar: مراجعة سلة المشتريات

source: No products in stock.
ar: لا توجد منتجات في المخزن.

source: Available
ar: المتوفر

source: Price
ar: السعر

source: Add
ar: إضافة

# quantityExceedsStock
source: Requested quantity is more than available in stock!
ar: الكمية المطلوبة أكبر من المتوفر في المخزن!

# cartIsEmpty
source: Shopping cart is empty!
ar: سلة المشتريات فارغة!

source: product
ar: منتج

source: Total
ar: الإجمالي

source: Final Total
ar: الإجمالي النهائي

source: Close
ar: إغلاق

source: Items: {count}
ar: عدد الأصناف: {count}

source: Total Salaries Paid
ar: إجمالي الرواتب المدفوعة

source: Total Advances Balance
ar: إجمالي السلف المستحقة

source: Active Employees Count
ar: عدد الموظفين النشطين

source: Employees Statement
ar: كشف حساب الموظفين

source: No employees to display.
ar: لا يوجد موظفون لعرضهم.

# salaryLabel
source: Basic salary
ar: الراتب: {salary}

source: Total Net Profit
ar: إجمالي صافي الربح

source: Sales Details
ar: تفاصيل المبيعات

source: Loading details...
ar: جاري تحميل التفاصيل...

# noSalesRecorded
source: No sales have been recorded yet
ar: لا توجد مبيعات مسجلة لعرضها.

# customerLabel
source: Customer: {name}
ar: الزبون: {name}

# dateLabel
source: Date: {date}
ar: التاريخ: {date}

# profitLabel
source: Profit: {profit}
ar: الربح: {profit}

# saleLabel
source: Sale: {sale}
ar: المبيع: {sale}

source: General Profit Report
ar: تقرير الأرباح العام

# generalProfitReportSubtitle
source: View summary of profits, expenses, and net profit
ar: عرض ملخص الأرباح والمصاريف وصافي الربح

# supplierProfitReportSubtitle
source: View profits grouped by supplier and partner share distribution
ar: عرض الأرباح مجمعة حسب كل مورد وتوزيع حصص الشركاء

source: Cash Sales History
ar: سجل المبيعات النقدية

# cashSalesHistorySubtitle
source: View and manage direct sale invoices
ar: عرض وإدارة فواتير البيع المباشر

source: Cash Flow Report
ar: تقرير المقبوضات النقدية

# cashFlowReportSubtitle
source: View cash sales and customer debt payments
ar: عرض المبيعات النقدية وتسديدات الزبائن

# expensesLog
source: General Expenses Log
ar: سجل المصاريف العامة

# expensesLogSubtitle
source: View and record operational expenses
ar: عرض وتسجيل المصاريف التشغيلية

# employeesAndSalariesReport
source: Employees & Salaries Report
ar: تقرير الموظفين والرواتب

# employeesAndSalariesReportSubtitle
source: View summary of salaries, advances, and employee statements
ar: عرض ملخص الرواتب والسلف وكشوفات حساب الموظفين

# noProfitsRecorded
source: No profits recorded to display.
ar: لا توجد أرباح مسجلة لعرضها.

# partnersLabel
source: Partners: {names}
ar: الشركاء: {names}

# netProfitLabel
source: Net Profit: {amount}
ar: الربح الصافي: {amount}

source: Select Date Range
ar: تحديد فترة زمنية

source: Total Cash Sales
ar: إجمالي المبيعات النقدية

source: Total Debt Payments
ar: إجمالي مقبوضات الديون

source: Total Cash Inflow
ar: إجمالي الرصيد النقدي الوارد

source: Show Details
ar: إظهار التفاصيل

source: Hide Details
ar: إخفاء التفاصيل

# noTransactions
source: No cash transactions in this period.
ar: لا توجد معاملات نقدية في هذه الفترة.

# cashSaleDescription
source: Direct Cash Sale (Invoice #{id})
ar: بيع نقدي مباشر (فاتورة #{id})

# debtPaymentDescription
source: Payment from customer: {name}
ar: تسديد من الزبون: {name}

# recordWithdrawalFor
source: Withdraw Profits for: {name}
ar: تسجيل سحب لـ: {name}

# availableNetProfit
source: Available Net Profit for Distribution: {amount}
ar: الربح الصافي المتاح للتوزيع: {amount}

source: Withdrawn Amount
ar: المبلغ المسحوب

# amountExceedsProfit
source: Amount exceeds available profit
ar: المبلغ أكبر من الربح المتاح

# withdrawalSuccess
source: Withdrawal recorded successfully
ar: تم تسجيل السحب بنجاح

source: Total Profit from Supplier
ar: إجمالي الربح من المورد:

source: Total Withdrawals:
ar: إجمالي المسحوبات:

source: Remaining Net Profit
ar: الربح الصافي المتبقي:

source: Partners' Profit Distribution
ar: توزيع أرباح الشركاء

# partnerShare
source: Share of net profit: {amount}
ar: حصته من الربح الصافي: {amount}

source: Withdraw
ar: سحب

source: Record General Withdrawal
ar: تسجيل سحب عام

source: Withdrawals History
ar: سجل المسحوبات

# noWithdrawals
source: No withdrawals recorded.
ar: لا توجد مسحوبات مسجلة.

# withdrawalAmountLabel
source: Amount: {amount}
ar: مبلغ: {amount}

# withdrawalForLabel
source: For: {name}
ar: لـ: {name}

source: Refresh
ar: تحديث

# noDataToShow
source: No data to display.
ar: لا توجد بيانات لعرضها.

source: Show Sales Details
ar: إظهار تفاصيل المبيعات

source: Hide Sales Details
ar: إخفاء تفاصيل المبيعات

source: Gross Profit from Sales
ar: إجمالي الربح من المبيعات

source: Total General Expenses
ar: (-) إجمالي المصاريف العامة
