Repository: Speed3d/accounting_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Total Profit Withdrawals
ar: (-) إجمالي مسحوبات الأرباح

source: Net Profit
ar: صافي الربح النهائي

source: Total profit from this supplier
ar: إجمالي الربح من هذا المورد

# noPartnersForThisSupplier
source: No partners registered for this supplier.
ar: لا يوجد شركاء مسجلون لهذا المورد.

source: No sales for this supplier.
ar: لا توجد مبيعات لهذا المورد.

source: Search by invoice number...
ar: ابحث برقم الفاتورة...

source: Show Invoices
ar: إظهار الفواتير

source: Hide Invoices
ar: إخفاء الفواتير

# noCashInvoices
source: No cash sale invoices recorded.
ar: لا توجد فواتير بيع نقدي مسجلة.

# invoiceNo
source: Invoice No: {id}
ar: فاتورة رقم: {id}

source: Modified
ar: معدلة

source: Voided
ar: ملغاة

# confirmVoidTitle
source: Confirm Invoice Void
ar: تأكيد إلغاء الفاتورة

# confirmVoidContent
source: Are you sure you want to void this entire invoice? All its products will be returned to stock.
ar: هل أنت متأكد من إلغاء هذه الفاتورة بالكامل؟ سيتم إرجاع جميع منتجاتها إلى المخزن.

# confirmVoidAction
source: Yes, Void
ar: نعم، قم بالإلغاء

# voidSuccess
source: Invoice voided successfully.
ar: تم إلغاء الفاتورة بنجاح.

# detailsForInvoice
source: Details for Invoice #{id}
ar: تفاصيل الفاتورة #{id}

source: Direct selling
ar: بيع مباشر

source: Direct Sale Point
ar: نقطة البيع المباشر

source: Complete Sale
ar: إتمام البيع

# saleSuccess
source: Sale completed successfully!
ar: تم البيع بنجاح!

# pdfInvoiceTitle
source: Cash Sale Invoice
ar: فاتورة بيع نقدي

# pdfDate
source: Date
ar: التاريخ

# pdfInvoiceNumber
source: Invoice #
ar: فاتورة رقم

# pdfHeaderProduct
source: Product
ar: المنتج

# pdfHeaderQty
source: Qty
ar: الكمية

# pdfHeaderPrice
source: Price
ar: السعر

# pdfHeaderTotal
source: Total
ar: الإجمالي

# pdfFooterTotal
source: Total Amount
ar: المبلغ الإجمالي

# pdfFooterThanks
source: Thank you for your business
ar: شكراً لتعاملكم معنا

source: Manage Expense Categories
ar: إدارة فئات المصاريف

source: No Categories
ar: لا توجد فئات. قم بإضافة أول فئة.

source: Add Category
ar: إضافة فئة جديدة

source: Edit Category
ar: تعديل الفئة

source: Category Name
ar: اسم الفئة

# categoryNameRequired
source: Category name is required
ar: اسم الفئة مطلوب

# categoryExistsError
source: Error: This category name already exists.
ar: خطأ: اسم الفئة هذا موجود بالفعل.

# confirmDeleteTitle
source: Confirm Deletion
ar: تأكيد الحذف

# confirmDeleteCategory
source: Are you sure you want to delete the category "{name}"?
ar: هل أنت متأكد من حذف الفئة "{name}"؟

source: Manage Categories
ar: إدارة الفئات

source: No Expenses
ar: لا توجد مصاريف مسجلة.

source: Add Expense
ar: إضافة مصروف جديد

source: New Expense
ar: تسجيل مصروف جديد

source: Expense Description
ar: وصف المصروف

# descriptionRequired
source: Description is required
ar: الوصف مطلوب

source: Amount
ar: بقيمة:

source: Category
ar: الفئة

source: Select category
ar: الرجاء اختيار فئة

# addCategoriesFirst
source: Please add expense categories first
ar: الرجاء إضافة فئات المصاريف أولاً من شاشة إدارة الفئات.

# expenseAddedSuccess
source: Expense added successfully
ar: تم تسجيل المصروف بنجاح.

source: Unclassified
ar: غير مصنف

source: Dashboard
ar: لوحة التحكم

source: Today
ar: اليوم

source: This Month
ar: هذا الشهر

source: Sales
ar: المبيعات

source: Profit
ar: الربح

source: Top Selling
ar: الأكثر مبيعاً

source: Top Customer
ar: العميل المميز

# generalStats
source: General Statistics
ar: إحصائيات عامة

# totalCustomers
source: Customers
ar: العملاء

# totalProducts
source: Products
ar: المنتجات

source: Low Stock
ar: مخزون منخفض

source: Pending Payments
ar: مدفوعات معلقة

source: Top buyer this month
ar: العميل الأكثر شراءً هذا الشهر

# noSalesData
source: Not enough data to show top selling products
ar: لا توجد بيانات كافية لعرض المنتجات الأكثر مبيعاً

# noCustomersData
source: Not enough data to show top customer
ar: لا توجد بيانات كافية لعرض العميل المميز

# loadingStats
source: Loading statistics...
ar: جاري تحميل الإحصائيات...

# currency
source: IQD
ar: د.ع

source: Error loading data
ar: خطأ في تحميل البيانات

source: Please try again
ar: يرجى المحاولة مرة أخرى

source: No Sales
ar: لا توجد مبيعات

source: No customers
ar: لا يوجد عملاء

source: Enter customer name
ar: أدخل اسم العميل

source: Enter address
ar: أدخل العنوان

# enterPhone
source: Enter phone number
ar: أدخل رقم الهاتف

source: Update customer
ar: تحديث بيانات العميل

source: Loading customers...
ar: جاري تحميل العملاء...

source: Search customers
ar: بحث في العملاء

source: Balanced
ar: متوازن

source: Archive customer
ar: أرشفة العميل

# customerArchivedSuccess
source: Customer archived successfully
ar: تم أرشفة العميل بنجاح

source: Basic Information
ar: المعلومات الأساسية

source: Suppliers Management
ar: إدارة الموردين

source: Products Management
ar: إدارة المنتجات

source: Customers Management
ar: إدارة العملاء

source: Employees Management
ar: إدارة الموظفين

source: Reports And Sales
ar: التقارير والمبيعات

source: System Settings
ar: إعدادات النظام

source: Change Image
ar: تغيير الصورة

source: Primary Admin Account
ar: حساب المدير الرئيسي

# primaryAdminNote
source: You can only edit your name, photo, and password. Permissions protect
ar: يمكنك تعديل الاسم والصورة وكلمة المرور فقط. الصلاحيات محمية

# updateProfile
source: Edit profile
ar: تعديل الملف الشخصي

source: Update User
ar: تحديث المستخدم

source: Editing Your Profile
ar: تعديل ملفك الشخصي

# selfEditNote
source: You can edit your name, username, password, and profile picture. Permissions are protected
ar: يمكنك تعديل اسمك، اسم المستخدم، كلمة المرور، والصورة الشخصية. الصلاحيات محمية

source: Transaction details
ar: تفاصيل المعاملات

source: No Transactions In Period
ar: لا توجد معاملات في هذه الفترة

source: Cash In
ar: الوارد

source: Appearance
ar: المظهر

source: Dark Mode
ar: الوضع الليلي

# darkModeEnabled
source: Enabled - Relax your eyes 😌
ar: مفعّل - العيون مرتاحة 😌

# darkModeDisabled
source: Disabled - Enjoy the light ☀️
ar: معطّل - استمتع بالنور ☀️

# appTitle
source: Smart Accounting System
ar: نظام المحاسبة الذكي

# appVersion
source: Version 1.0.0
ar: الإصدار 1.0.0

source: Loading...
ar: جاري التحميل...

# appDescription
source: A smart and integrated accounting system to manage your business easily and professionally
ar: نظام محاسبي ذكي ومتكامل لإدارة أعمالك بسهولة واحترافية

# companyInfo
source: Company Information
ar: معلومات الشركة

source: Company Name
ar: اسم الشركة

source: Not specified
ar: غير محدد

source: Description
ar: الوصف

# developerInfo
source: Developer Information
ar: معلومات المطور

source: Developer
ar: المطور

source: Email
ar: البريد الإلكتروني

# rightsReserved
source: © 2025 All rights reserved
ar: © 2025 جميع الحقوق محفوظة

source: Made with
ar: صُنع بـ

# madeInIraq
source: In Iraq 🇮🇶
ar: في العراق 🇮🇶

source: Loading data...
ar: جاري تحميل البيانات...

source: Save changes
ar: حفظ التغييرات

source: All
ar: الكل

source: User
ar: مستخدم

source: Loading users...
ar: جاري تحميل المستخدمين...

# loadError
source: Error loading data
ar: حدث خطأ أثناء تحميل البيانات

source: Add new user
ar: إضافة مستخدم جديد

source: No results
ar: لا توجد نتائج

# noUsersMatch
source: No users found with these criteria
ar: لم يتم العثور على مستخدمين بهذه المعايير

# searchUser
source: Search for a user...
ar: البحث عن مستخدم...

source: Total users
ar: إجمالي المستخدمين

source: Admins
ar: المدراء

source: Permission
ar: صلاحية

source: View & Edit
ar: عرض وتعديل

source: View only
ar: عرض فقط

source: None
ar: لا يوجد

source: View
ar: عرض

source: Full Access
ar: إدارة كاملة

source: Employee Reports
ar: تقارير الموظفين

source: Expenses
ar: المصاريف

source: Cash Sales
ar: المبيعات النقدية

# noPermissions
source: No permissions granted
ar: لا توجد صلاحيات ممنوحة

# noUndo
source: This action cannot be undone
ar: هذا الإجراء لا يمكن التراجع عنه

# deleteError
source: An error occurred while deleting
ar: حدث خطأ أثناء الحذف

source: Loading suppliers...
ar: جاري تحميل الموردين...

# noSuppliers
source: No suppliers available
ar: لا يوجد موردين حالياً

source: Add new supplier
ar: إضافة مورد جديد

# noSuppliersMatch
source: No suppliers found with this name
ar: لم يتم العثور على موردين بهذا الاسم

# searchSupplier
source: Search for a supplier...
ar: البحث عن مورد...

source: Total suppliers
ar: إجمالي الموردين

source: Individuals
ar: أفراد

# canRestoreSupplier
source: You can restore this supplier later from the archive center
ar: يمكنك استعادة المورد لاحقاً من مركز الأرشيف

source: Supplier archived
ar: تم أرشفة المورد

# archiveError
source: Archiving error
ar: خطأ في الأرشفة

# basicInfo
source: Basic Information
ar: المعلومات الأساسية

source: Enter supplier name
ar: أدخل اسم المورد

# additionalInfoOptional
source: Additional information (optional)
ar: معلومات إضافية (اختيارية)

source: Enter phone number
ar: أدخل رقم الهاتف

# enterNotes
source: Enter any notes
ar: أدخل أي ملاحظات

source: Update supplier
ar: تحديث المورد

# createSupplier
source: Add supplier
ar: إضافة المورد

source: Delete Partner
ar: حذف الشريك

# confirmDeletePartner
source: Are you sure you want to delete partner "{name}"?
ar: هل أنت متأكد من حذف الشريك

# updateSupplierInfo
source: Update supplier information
ar: تحديث بيانات المورد

# addNewSupplierAgain
source: Add new supplier
ar: إضافة مورد جديد

# saveError
source: An error occurred while saving
ar: حدث خطأ أثناء الحفظ

# editPartnerInfo
source: Edit partner information
ar: تعديل بيانات الشريك

# partnerInfo
source: Partner information
ar: معلومات الشريك

source: Enter partner name
ar: أدخل اسم الشريك

# enterPartnerShare
source: Enter partnership percentage (1-100)
ar: أدخل نسبة الشراكة (1-100)

# invalidShare
source: Invalid percentage
ar: النسبة المدخلة

# additionalInfo
source: Additional information
ar: معلومات إضافية

source: Update partner
ar: تحديث الشريك

# createPartner
source: Add partner
ar: اضافة الشريك

source: Archive product
ar: أرشفة المنتج

source: Product archived
ar: تم أرشفة

# errorArchiveRestor
source: Error restoring: {error}
ar: حدث خطأ أثناء الاستعادة: {error}

# restoreConfirm
source: Do you want to restore "{name}"?
ar: هل تريد استعادة "{name}"؟

# restoretheitem
source: Restore The Item "{name}"?
ar: استعادة العنصر "{name}"?

source: Loading products...
ar: جاري تحميل المنتجات...

# startByAddingProduct
source: Start by adding your first product in inventory
ar: ابدأ بإضافة أول منتج في المخزون

source: Add new product
ar: إضافة منتج جديد

source: Total quantity
ar: إجمالي الكمية

source: Low
ar: منخفضة

source: Value
ar: القيمة

# tryAnotherSearch
source: Try searching another keyword
ar: جرب البحث بكلمة أخرى

source: Purchase
ar: الشراء

source: Sell
ar: البيع

# pointCameraToBarcode
source: Point the camera at the barcode to scan
ar: وجّه الكاميرا نحو الباركود للمسح

# supplierInfo
source: Supplier information
ar: معلومات المورد

# productInfo
source: Product information
ar: معلومات المنتج

source: Enter product name
ar: أدخل اسم المنتج

source: Scan or enter barcode
ar: امسح أو أدخل الباركود

source: Enter product details
ar: أدخل تفاصيل المنتج

source: Quantity and prices
ar: الكمية والأسعار

source: Enter quantity
ar: أدخل الكمية

source: Purchase price
ar: سعر الشراء

source: Sale price
ar: سعر البيع

source: Prices summary
ar: ملخص الأسعار

source: Loading employees...
ar: جاري تحميل الموظفين...

# startByAddingEmployee
source: Start by adding your first employee
ar: ابدأ بإضافة أول موظف في فريقك

source: Add new employee
ar: إضافة موظف جديد

source: Total salaries
ar: إجمالي الرواتب

source: Total advances
ar: إجمالي السلف

source: Salary
ar: الراتب

source: Advance
ar: السلف

source: Months
ar: الأشهر

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

# noSalaryPaidYet
source: No salary has been paid yet
ar: لم يتم صرف أي راتب بعد

source: Add salary
ar: إضافة راتب

source: Pay salary
ar: صرف راتب

source: Add new salary
ar: إضافة راتب جديد

# paidAt
source: Paid on:
ar: دُفع في:

source: Net
ar: صافي

source: Add advance
ar: إضافة سلفة

source: Add new advance
ar: إضافة سلفة جديدة

source: Salary details
ar: تفاصيل راتب

# recordSalaryFor
source: Record salary for month
ar: تسجيل راتب شهر

source: for employee
ar: للموظف

source: Select Payment Date
ar: اختر تاريخ الدفع

source: Confirm
ar: تأكيد

source: Financial Period
ar: الفترة المالية

source: Salary Components
ar: مكونات الراتب

source: Basic salary
ar: الراتب الأساسي

# deductionAndPenalties
source: Deductions & penalties
ar: الخصومات والغرامات

# deductAdvance
source: Deduct advances from salary
ar: خصم السلف من الراتب

source: Select Date
ar: اختر التاريخ

source: Any additional notes
ar: أي ملاحظات إضافية

source: Detailed Summary
ar: الملخص التفصيلي

source: Update employee data:
ar: تحديث بيانات الموظف:

# addNewEmployeeData
source: Add new employee:
ar: إضافة موظف جديد:

source: Select hiring date
ar: اختر تاريخ التعيين

# personalInfo
source: Personal information
ar: المعلومات الشخصية

source: Enter full name
ar: أدخل الاسم الكامل

# jobInfo
source: Job information
ar: معلومات الوظيفة

source: Enter job title
ar: أدخل المسمى الوظيفي

# financialInfo
source: Financial information
ar: المعلومات المالية

source: Enter basic salary
ar: أدخل الراتب الأساسي

# recordEmployeeAdvance
source: Record an advance for employee:
ar: تسجيل سلفة للموظف:

source: Select advance date
ar: اختر تاريخ السلفة

source: Advance data
ar: بيانات السلفة

source: Enter advance amount
ar: أدخل مبلغ السلفة

# enterAdvanceNotes
source: Enter any additional notes
ar: أدخل أي ملاحظات إضافية

source: Current Balance
ar: الرصيد الحالي

source: Financial summary
ar: الملخص المالي

source: Expected balance
ar: الرصيد المتوقع

# autoDeductAdvance
source: The advance amount will be automatically deducted from upcoming salaries until fully paid
ar: سيتم خصم قيمة السلفة تلقائياً من الرواتب القادمة حتى تسديدها بالكامل

# deleteUserSuccess
source: User "{userName}" deleted successfully
ar: تم حذف المستخدم "{userName}" بنجاح

# deleteUserError
source: An error occurred while deleting: {error}
ar: حدث خطأ أثناء الحذف: {error}

source: Permissions
ar: صلاحيات

# deleteSupplierSuccess
source: Resource deleted "{supplierName}" Success
ar: تم حذف المورد "{supplierName}" بنجاح

# deleteSupplierError
source: An error occurred during deletion: {error}
ar: حدث خطأ أثناء الحذف: {error}
